guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_clock.c
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LF_CAL_ENABLED)
    volatile nrfx_clock_cal_state_t cal_state;
#endif

#if NRFX_CHECK(NRF_CLOCK_HAS_XO_TUNE)
    volatile bool xo_tune_in_progress;
#endif
} nrfx_clock_cb_t;

static nrfx_clock_cb_t m_clock_cb;

/**
 * This variable is used to check whether common POWER_CLOCK common interrupt
 * should be disabled or not if @ref nrfx_power tries to disable the interrupt.
 */
#if NRFX_CHECK(NRFX_POWER_ENABLED)
bool nrfx_clock_irq_enabled;
#endif

#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_132)
/**
 * @brief Function for applying delay of 138us before starting LFCLK.
 */
static void nrfx_clock_anomaly_132(void)
{
    uint32_t cyccnt_inital;
    uint32_t core_debug;
    uint32_t dwt_ctrl;

    // Preserve DEMCR register to do not influence into its configuration. Enable the trace and
    // debug blocks. It is required to read and write data to DWT block.
    core_debug = CoreDebug->DEMCR;
    CoreDebug->DEMCR = core_debug | CoreDebug_DEMCR_TRCENA_Msk;

    // Preserve CTRL register in DWT block to do not influence into its configuration. Make sure
    // that cycle counter is enabled.
    dwt_ctrl = DWT->CTRL;
    DWT->CTRL = dwt_ctrl | DWT_CTRL_CYCCNTENA_Msk;

    // Store start value of cycle counter.
    cyccnt_inital = DWT->CYCCNT;

    // Delay required time.
    while ((DWT->CYCCNT - cyccnt_inital) < ANOMALY_132_DELAY_CYCLES)
    {}

    // Restore preserved registers.
    DWT->CTRL = dwt_ctrl;
    CoreDebug->DEMCR = core_debug;
}
#endif // NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_132)

static void clock_stop(nrf_clock_domain_t domain)
{
    uint32_t          int_mask;
    nrf_clock_event_t event;
    nrf_clock_task_t  task;
    switch (domain)
    {
        case NRF_CLOCK_DOMAIN_LFCLK:
            int_mask = NRF_CLOCK_INT_LF_STARTED_MASK;
            task = NRF_CLOCK_TASK_LFCLKSTOP;
            event = NRF_CLOCK_EVENT_LFCLKSTARTED;
            break;
        case NRF_CLOCK_DOMAIN_HFCLK:
            int_mask = NRF_CLOCK_INT_HF_STARTED_MASK |
#if NRF_CLOCK_HAS_XO_TUNE
                       NRF_CLOCK_INT_XOTUNED_MASK |
                       NRF_CLOCK_INT_XOTUNEFAILED_MASK |
                       NRF_CLOCK_INT_XOTUNEERROR_MASK |
#endif
                       0;
            task = NRF_CLOCK_TASK_HFCLKSTOP;
            event = NRF_CLOCK_EVENT_HFCLKSTARTED;
            break;
#if NRF_CLOCK_HAS_HFCLK192M
        case NRF_CLOCK_DOMAIN_HFCLK192M:
            int_mask = NRF_CLOCK_INT_HF192M_STARTED_MASK;
            task = NRF_CLOCK_TASK_HFCLK192MSTOP;
            event = NRF_CLOCK_EVENT_HFCLK192MSTARTED;
            break;
#endif
#if NRF_CLOCK_HAS_HFCLKAUDIO
        case NRF_CLOCK_DOMAIN_HFCLKAUDIO:
            int_mask = NRF_CLOCK_INT_HFAUDIO_STARTED_MASK;
            task = NRF_CLOCK_TASK_HFCLKAUDIOSTOP;
            event = NRF_CLOCK_EVENT_HFCLKAUDIOSTARTED;
            break;
#endif
        default:
            NRFX_ASSERT(0);
            return;
    }

    nrf_clock_int_disable(NRF_CLOCK, int_mask);
    nrf_clock_task_trigger(NRF_CLOCK, task);
    nrf_clock_event_clear(NRF_CLOCK, event);
#if NRFX_CHECK(NRF54L_ERRATA_39_ENABLE_WORKAROUND)
    if (nrf54l_errata_39() && (domain == NRF_CLOCK_DOMAIN_HFCLK))
    {
        nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_PLLSTOP);
    }
#endif

    bool stopped;
    nrf_clock_hfclk_t clk_src = NRF_CLOCK_HFCLK_HIGH_ACCURACY;
    nrf_clock_hfclk_t *p_clk_src = (domain == NRF_CLOCK_DOMAIN_HFCLK) ? &clk_src : NULL;
    NRFX_WAIT_FOR((!nrfx_clock_is_running(domain, p_clk_src) ||
                      (p_clk_src && clk_src != NRF_CLOCK_HFCLK_HIGH_ACCURACY)), 10000, 1, stopped);
    if (!stopped)
    {
        NRFX_LOG_ERROR("Failed to stop clock domain: %d.", domain);
    }

#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_201)
    if (domain == NRF_CLOCK_DOMAIN_HFCLK)
    {
            m_clock_cb.hfclk_started = false;
    }
#endif
}

static nrf_clock_lfclk_t clock_initial_lfclksrc_get(void)
{
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LFXO_TWO_STAGE_ENABLED)
    return NRF_CLOCK_LFCLK_RC;
#else
    return (nrf_clock_lfclk_t)NRFX_CLOCK_CONFIG_LF_SRC;
#endif
}

/**
 * @brief Function for tweaking the specified low-frequency clock source given current driver state.
 *
 * @warning This function may stop currently running low-frequency clock source.
 *
 * @param[in,out] p_lfclksrc Pointer to the variable containing low-frequency clock source.
 *                           It is set to adequate value in case of being inappropriate
 *                           for current driver configuration.
 *
 * @return True if the specified clock source was correct, false otherwise.
 */
static bool clock_lfclksrc_tweak(nrf_clock_lfclk_t * p_lfclksrc)
{
    bool is_correct_clk = (*p_lfclksrc == NRFX_CLOCK_CONFIG_LF_SRC);
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LFXO_TWO_STAGE_ENABLED)
    // In case of two-stage LFXO start procedure RC source is valid as well.
    is_correct_clk = is_correct_clk || (*p_lfclksrc == NRF_CLOCK_LFCLK_RC);
#endif
    if (!is_correct_clk)
    {
        // Inappropriate LF clock source is chosen.
        // Stop currently active LF clock source and choose the correct one to start.
        clock_stop(NRF_CLOCK_DOMAIN_LFCLK);
        *p_lfclksrc = clock_initial_lfclksrc_get();
    }
    return is_correct_clk;
}

nrfx_err_t nrfx_clock_init(nrfx_clock_event_handler_t event_handler)
{
    nrfx_err_t err_code = NRFX_SUCCESS;
    if (m_clock_cb.module_initialized)
    {
        err_code = NRFX_ERROR_ALREADY;
    }
    else
    {
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LF_CAL_ENABLED)
        m_clock_cb.cal_state = CAL_STATE_IDLE;
#endif
        m_clock_cb.event_handler = event_handler;
        m_clock_cb.module_initialized = true;
#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_201)
        m_clock_cb.hfclk_started = false;
#endif
    }

    NRFX_LOG_INFO("Function: %s, error code: %s.", __func__, NRFX_LOG_ERROR_STRING_GET(err_code));
    return err_code;
}

void nrfx_clock_enable(void)
{
    NRFX_ASSERT(m_clock_cb.module_initialized);
    if (m_clock_cb.event_handler)
    {
        nrfx_power_clock_irq_init();
    }
    nrf_clock_lf_src_set(NRF_CLOCK, clock_initial_lfclksrc_get());
#if NRF_CLOCK_HAS_HFCLKSRC
    nrf_clock_hf_src_set(NRF_CLOCK, NRF_CLOCK_HFCLK_HIGH_ACCURACY);
#endif
#if NRF_CLOCK_HAS_HFCLK192M
    nrf_clock_hfclk192m_src_set(NRF_CLOCK, (nrf_clock_hfclk_t)NRFX_CLOCK_CONFIG_HFCLK192M_SRC);
#endif
#if NRFX_CHECK(NRFX_POWER_ENABLED)
    nrfx_clock_irq_enabled = true;
#endif

