guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_clock.c
    NRFX_LOG_INFO("Module enabled.");
}

void nrfx_clock_disable(void)
{
    NRFX_ASSERT(m_clock_cb.module_initialized);

    if (m_clock_cb.event_handler)
    {
#if NRFX_CHECK(NRFX_POWER_ENABLED)
        NRFX_ASSERT(nrfx_clock_irq_enabled);
        if (!nrfx_power_irq_enabled)
#endif
        {
#if defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
            IRQn_Type irqn = CLOCK_POWER_IRQn;
#else
            IRQn_Type irqn = nrfx_get_irq_number(NRF_CLOCK);
#endif
            NRFX_IRQ_DISABLE(irqn);
        }
    }
    nrf_clock_int_disable(NRF_CLOCK, NRF_CLOCK_INT_HF_STARTED_MASK |
                                     NRF_CLOCK_INT_LF_STARTED_MASK |
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LF_CAL_ENABLED)
                                     NRF_CLOCK_INT_DONE_MASK |
#if NRF_CLOCK_HAS_CALIBRATION_TIMER
                                     NRF_CLOCK_INT_CTTO_MASK |
#endif
#endif // NRFX_CHECK(NRFX_CLOCK_CONFIG_LF_CAL_ENABLED)
                          0);
#if NRFX_CHECK(NRFX_POWER_ENABLED)
    nrfx_clock_irq_enabled = false;
#endif
    NRFX_LOG_INFO("Module disabled.");
}

void nrfx_clock_uninit(void)
{
    NRFX_ASSERT(m_clock_cb.module_initialized);
    clock_stop(NRF_CLOCK_DOMAIN_LFCLK);
    clock_stop(NRF_CLOCK_DOMAIN_HFCLK);
#if NRF_CLOCK_HAS_HFCLK192M
    clock_stop(NRF_CLOCK_DOMAIN_HFCLK192M);
#endif
#if NRF_CLOCK_HAS_HFCLKAUDIO
    clock_stop(NRF_CLOCK_DOMAIN_HFCLKAUDIO);
#endif
    m_clock_cb.module_initialized = false;
    NRFX_LOG_INFO("Uninitialized.");
}

bool nrfx_clock_init_check(void)
{
    return m_clock_cb.module_initialized;
}

void nrfx_clock_start(nrf_clock_domain_t domain)
{
    uint32_t          int_mask;
    nrf_clock_event_t event;
    nrf_clock_task_t  task;

    NRFX_ASSERT(m_clock_cb.module_initialized);
    switch (domain)
    {
        case NRF_CLOCK_DOMAIN_LFCLK:
        {
            nrf_clock_lfclk_t lfclksrc;
            if (nrf_clock_is_running(NRF_CLOCK, NRF_CLOCK_DOMAIN_LFCLK, &lfclksrc))
            {
                // LF clock is already running. Inspect its source.
                // If LF clock source is inappropriate then it will be stopped and modified.
                // Ignore return value as LF clock will be started again regardless of the result.
                (void)clock_lfclksrc_tweak(&lfclksrc);
            }
            else if (nrf_clock_start_task_check(NRF_CLOCK, NRF_CLOCK_DOMAIN_LFCLK))
            {
                // LF clock is not active yet but was started already. Inspect its source.
                lfclksrc = nrf_clock_lf_srccopy_get(NRF_CLOCK);
                if (clock_lfclksrc_tweak(&lfclksrc))
                {
                    // LF clock was started already and the configured source
                    // corresponds to the user configuration.
                    // No action is needed as the chosen LF clock source will become active soon.
                    if (m_clock_cb.event_handler)
                    {
                        nrf_clock_int_enable(NRF_CLOCK, NRF_CLOCK_INT_LF_STARTED_MASK);
                    }
                    else
                    {
                        while (!nrf_clock_event_check(NRF_CLOCK, NRF_CLOCK_EVENT_LFCLKSTARTED))
                        {}
                        nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_LFCLKSTARTED);
                    }
                    return;
                }
                // Otherwise LF clock was started already but with inappropriate source.
                // LF clock was stopped and modified. Now it will be restarted.
            }
            else
            {
                // LF clock not active and not started.
                lfclksrc = clock_initial_lfclksrc_get();
            }
            nrf_clock_lf_src_set(NRF_CLOCK, lfclksrc);
        }
            event    = NRF_CLOCK_EVENT_LFCLKSTARTED;
            int_mask = NRF_CLOCK_INT_LF_STARTED_MASK;
            task     = NRF_CLOCK_TASK_LFCLKSTART;
            break;
        case NRF_CLOCK_DOMAIN_HFCLK:
            event    = NRF_CLOCK_EVENT_HFCLKSTARTED;
            int_mask = NRF_CLOCK_INT_HF_STARTED_MASK |
#if NRF_CLOCK_HAS_XO_TUNE
                       NRF_CLOCK_INT_XOTUNED_MASK |
                       NRF_CLOCK_INT_XOTUNEERROR_MASK |
                       NRF_CLOCK_INT_XOTUNEFAILED_MASK |
#endif
                       0;
#if NRF_CLOCK_HAS_XO_TUNE
            nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_XOTUNED);
            nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_XOTUNEFAILED);
            nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_XOTUNEERROR);
#endif
            task     = NRF_CLOCK_TASK_HFCLKSTART;
#if NRFX_CHECK(NRF54L_ERRATA_39_ENABLE_WORKAROUND)
            if (nrf54l_errata_39())
            {
                nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_PLLSTART);
            }
#endif
            break;
#if NRF_CLOCK_HAS_HFCLK192M
        case NRF_CLOCK_DOMAIN_HFCLK192M:
            event    = NRF_CLOCK_EVENT_HFCLK192MSTARTED;
            int_mask = NRF_CLOCK_INT_HF192M_STARTED_MASK;
            task     = NRF_CLOCK_TASK_HFCLK192MSTART;
            break;
#endif
#if NRF_CLOCK_HAS_HFCLKAUDIO
        case NRF_CLOCK_DOMAIN_HFCLKAUDIO:
            event    = NRF_CLOCK_EVENT_HFCLKAUDIOSTARTED;
            int_mask = NRF_CLOCK_INT_HFAUDIO_STARTED_MASK;
            task     = NRF_CLOCK_TASK_HFCLKAUDIOSTART;
            break;
#endif
        default:
            NRFX_ASSERT(0);
            return;
    }

    nrf_clock_event_clear(NRF_CLOCK, event);
#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_132)
    if (event == NRF_CLOCK_EVENT_LFCLKSTARTED)
    {
        nrfx_clock_anomaly_132();
    }
#endif
    nrf_clock_task_trigger(NRF_CLOCK, task);
    if (m_clock_cb.event_handler)
    {
        nrf_clock_int_enable(NRF_CLOCK, int_mask);
    }
    else
    {
        while (!nrf_clock_event_check(NRF_CLOCK, event))
        {}
        nrf_clock_event_clear(NRF_CLOCK, event);
    }
}

void nrfx_clock_stop(nrf_clock_domain_t domain)
{
    NRFX_ASSERT(m_clock_cb.module_initialized);
    clock_stop(domain);
}

#if NRF_CLOCK_HAS_CALIBRATION && NRFX_CHECK(NRFX_CLOCK_CONFIG_LF_CAL_ENABLED)
nrfx_err_t nrfx_clock_calibration_start(void)
{
    nrfx_err_t err_code = NRFX_SUCCESS;

    nrf_clock_hfclk_t clk_src;
    if (!nrfx_clock_is_running(NRF_CLOCK_DOMAIN_HFCLK, &clk_src))
    {
        err_code = NRFX_ERROR_INVALID_STATE;
    }
    else if (clk_src != NRF_CLOCK_HFCLK_HIGH_ACCURACY)
    {
        err_code = NRFX_ERROR_INVALID_STATE;
    }
    else if (!nrfx_clock_is_running(NRF_CLOCK_DOMAIN_LFCLK, NULL))
    {
        err_code = NRFX_ERROR_INVALID_STATE;
    }

    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    if (m_clock_cb.cal_state == CAL_STATE_IDLE)
    {
        nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_DONE);

        m_clock_cb.cal_state = CAL_STATE_CAL;
#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_192)
        *(volatile uint32_t *)0x40000C34 = 0x00000002;
#endif
        nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_CAL);
        if (m_clock_cb.event_handler)
        {
            nrf_clock_int_enable(NRF_CLOCK, NRF_CLOCK_INT_DONE_MASK);
        }
        else
        {
            while (!nrf_clock_event_check(NRF_CLOCK, NRF_CLOCK_EVENT_DONE))
            {}
            nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_DONE);
        }
    }
    else
    {
        err_code = NRFX_ERROR_BUSY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    NRFX_LOG_INFO("Initialized.");
    return err_code;
}

nrfx_err_t nrfx_clock_is_calibrating(void)
{
    if (m_clock_cb.cal_state == CAL_STATE_CAL)
    {
        return NRFX_ERROR_BUSY;
    }
    return NRFX_SUCCESS;
}

