guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_clock.c
        NRFX_LOG_DEBUG("Event: %s", NRFX_CLOCK_EVT2STR(evt_type));
        switch (int_mask)
        {
            case NRF_CLOCK_INT_HF_STARTED_MASK:
#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_201)
                if (!m_clock_cb.hfclk_started)
                {
                    m_clock_cb.hfclk_started = true;
                }
                else
                {
                    call_handler = false;
                }
#endif
                break;
            case NRF_CLOCK_INT_LF_STARTED_MASK:
            {
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LFXO_TWO_STAGE_ENABLED)
                nrf_clock_lfclk_t lfclksrc;
                (void)nrf_clock_is_running(NRF_CLOCK, NRF_CLOCK_DOMAIN_LFCLK, &lfclksrc);
                if (lfclksrc == NRF_CLOCK_LFCLK_RC)
                {
                    // After the LFRC oscillator start switch to external source.
                    nrf_clock_lf_src_set(NRF_CLOCK, (nrf_clock_lfclk_t)NRFX_CLOCK_CONFIG_LF_SRC);
                    nrf_clock_int_enable(NRF_CLOCK, int_mask);
                    nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_LFCLKSTART);
                    call_handler = false;
                }
                else
#endif
                {
                    // After the LF clock external source start invoke user callback.
                }
                break;
            }
#if NRFX_CHECK(NRFX_CLOCK_CONFIG_LF_CAL_ENABLED)
#if NRF_CLOCK_HAS_CALIBRATION_TIMER && NRFX_CHECK(NRFX_CLOCK_CONFIG_CT_ENABLED)
            case NRF_CLOCK_INT_CTTO_MASK:
                break;
#endif
            case NRF_CLOCK_INT_DONE_MASK:
#if NRFX_CHECK(USE_WORKAROUND_FOR_ANOMALY_192)
                *(volatile uint32_t *)0x40000C34 = 0x00000000;
#endif
                m_clock_cb.cal_state = CAL_STATE_IDLE;
                break;
#endif // NRFX_CLOCK_CONFIG_LF_CAL_ENABLED
#if NRF_CLOCK_HAS_HFCLKAUDIO
            case NRF_CLOCK_INT_HFAUDIO_STARTED_MASK:
                break;
#endif
#if NRF_CLOCK_HAS_HFCLK192M
            case NRF_CLOCK_INT_HF192M_STARTED_MASK:
                break;
#endif
#if NRFX_CHECK(NRF_CLOCK_HAS_XO_TUNE)
            case NRF_CLOCK_INT_XOTUNED_MASK:
                m_clock_cb.xo_tune_in_progress = false;
                // Enable XOTUNEERROR interrupt to handle situation when XO is out of tune.
                nrf_clock_event_clear(NRF_CLOCK, NRF_CLOCK_EVENT_XOTUNEERROR);
                nrf_clock_int_enable(NRF_CLOCK, NRF_CLOCK_INT_XOTUNEERROR_MASK);
                break;
            case NRF_CLOCK_INT_XOTUNEERROR_MASK:
                break;
            case NRF_CLOCK_INT_XOTUNEFAILED_MASK:
                m_clock_cb.xo_tune_in_progress = false;
                break;
#endif
            default:
                NRFX_ASSERT(0);
                break;
        }

        if (call_handler)
        {
            m_clock_cb.event_handler(evt_type);
        }
#if NRF_CLOCK_HAS_INTPEND
        intpend = nrf_clock_int_pending_get(NRF_CLOCK);
#endif
    }
}

#endif // NRFX_CHECK(NRFX_CLOCK_ENABLED)
